# DataFrame Combinations

In [23]:
import pandas as pd

## Concatenar DataFrames  -  pd.concat()

### Concatenación por filas

In [24]:
df_1 = pd.DataFrame({'names': ['Juan', 'Ana', 'Pedro', 'María'],
                    'age': [25, 30, 35, 40],
                    'career': ['Ing. Sistemas', 'Ing. Civil', 'Ing. Industrial', 'Ing. Ambiental']}) #.set_index('names')
df_2 = pd.DataFrame({'names': ['Jhon', 'Jane', 'Peter', 'Mary'],
                    'age': [25, 30, 35, 40],
                    'career': ['Computer Science', 'Civil Engineering', 'Industrial Engineering', 'Environmental Engineering']}) #.set_index('names')

In [25]:
df_1

   names  age           career
0   Juan   25    Ing. Sistemas
1    Ana   30       Ing. Civil
2  Pedro   35  Ing. Industrial
3  María   40   Ing. Ambiental

In [26]:
df_2

   names  age                     career
0   Jhon   25           Computer Science
1   Jane   30          Civil Engineering
2  Peter   35     Industrial Engineering
3   Mary   40  Environmental Engineering

In [27]:
pd.concat([df_1, df_2])

   names  age                     career
0   Juan   25              Ing. Sistemas
1    Ana   30                 Ing. Civil
2  Pedro   35            Ing. Industrial
3  María   40             Ing. Ambiental
0   Jhon   25           Computer Science
1   Jane   30          Civil Engineering
2  Peter   35     Industrial Engineering
3   Mary   40  Environmental Engineering

### Concatenación por columnas

In [29]:
df_1 = pd.DataFrame({'autos': ['Toyota', 'Nissan', 'Ford', 'Chevrolet'],
                     'color': ['Rojo', 'Azul', 'Blanco', 'Negro']}).set_index('autos')
df_2 = pd.DataFrame({'autos': ['Toyota', 'Nissan', 'Ford', 'Chevrolet'],
                     'modelo':[2018, 2002, 2005, 2020]}).set_index('autos')

In [30]:
df_1

            color
autos
Toyota       Rojo
Nissan       Azul
Ford       Blanco
Chevrolet   Negro

In [31]:
df_2

           modelo
autos
Toyota       2018
Nissan       2002
Ford         2005
Chevrolet    2020

In [33]:
pd.concat([df_1, df_2], axis=1)

            color  modelo
autos
Toyota       Rojo    2018
Nissan       Azul    2002
Ford       Blanco    2005
Chevrolet   Negro    2020

---

## Mezclar DataFrames - pd.merge()
```python
pd.merge(df_1, df_2, on='column_name', how='inner')
```
es similar al siguiente código SQL:

```sql
SELECT *
FROM df_1
    INNER JOIN df_2 ON df_1.attribute_name = df_2.attribute_name
WHERE condition;
```

entonces

how='inner', how='outer', how='left', how='right'


seria equivalente a


INNER JOIN, OUTER JOIN, LEFT JOIN, RIGHT JOIN

In [34]:
df_1

            color
autos
Toyota       Rojo
Nissan       Azul
Ford       Blanco
Chevrolet   Negro

In [35]:
df_2

           modelo
autos
Toyota       2018
Nissan       2002
Ford         2005
Chevrolet    2020

In [36]:
pd.merge(df_1, df_2, on='autos')

            color  modelo
autos
Toyota       Rojo    2018
Nissan       Azul    2002
Ford       Blanco    2005
Chevrolet   Negro    2020